neohung/stm32_examples/Task-03-USBCDC-StdPeriphDriver-FreeRTOS/src/syscalls.c
#include <sys/stat.h>
#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
#include "usbd_cdc_vcp.h"

int __errno;

int _close(int file) {
	return 0;
}

int _fstat(int file, struct stat *st) {
	return 0;
}

int _isatty(int file) {
	return 1;
}

int _lseek(int file, int ptr, int dir) {
	return 0;
}

int _open(const char *name, int flags, int mode) {
	return -1;
}

/* Register name faking - works in collusion with the linker.  */
register char * stack_ptr asm ("sp");

caddr_t _sbrk_r (struct _reent *r, int incr) {
	extern char   end asm ("end"); /* Defined by the linker.  */
	static char * heap_end;
	char *        prev_heap_end;

	if (heap_end == NULL)
		heap_end = & end;

	prev_heap_end = heap_end;

	if (heap_end + incr > stack_ptr) {
		//errno = ENOMEM;
		return (caddr_t) -1;
	}

	heap_end += incr;

	return (caddr_t) prev_heap_end;
}

//Here to implement printf
int _write(int file, char *ptr, int len) {
	VCP_send_buffer((uint8_t*)ptr, len);
	return len;
}

/*
#include <unistd.h> //FOR STDOUT_FILENO, STDERR_FILENO
int _write(int file, char *ptr, int len) {
       if (file == STDOUT_FILENO || file == STDERR_FILENO){
         int i = 0;
         while(i<len)
           ITM_SendChar(ptr[i++]);
       }
       return len;
}
*/
/*
int _read(int file, char *ptr, int len) {
	return len;
}
*/

//Here to implement scanf
int _read(int file, char *ptr, int len) {
	if (file != 0) {
		return 0;
	}

	// Use USB CDC Port for stdin
	while(!VCP_get_char((uint8_t*)ptr)){};

	// Echo typed characters
	//VCP_put_char((uint8_t)*ptr);

	return 1;
}

